Public Attributes | List of all members
API_AnalyticalVaryingSegment Struct Reference
Analytical Model
Describes a Structural Analytical Model Varying Segment for Curve Members. More...
#include <APIdefs_AnalyticalModel.h>
 Public Attributes
API_AnalyticalCrossSection  | begProfile
The begin profile of the segment. If the segment is not tapered, this is also the end profile.
GS::Optional< API_AnalyticalCrossSection >  | endProfile
If the segment is tapared, this describes the end profile of the segment.
double  | span = 0.0
Detailed Description
Describes a Structural Analytical Model Varying Segment for Curve Members.
Since
Archicad 26
Member Data Documentation
◆ begProfile
 API_AnalyticalVaryingSegment::begProfile
The begin profile of the segment. If the segment is not tapered, this is also the end profile.
◆ endProfile
 API_AnalyticalVaryingSegment::endProfile
If the segment is tapared, this describes the end profile of the segment.
◆ span
 double API_AnalyticalVaryingSegment::span = 0.0